{"pageContext":{"group":[{"node":{"id":"d06a0c89-7c16-5e57-945b-3cc493e0c7d5","frontmatter":{"path":null,"title":"Zero","date":"2013-08-09","readableDate":"09 August 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Zach Holman","quote":"The trick is finding out how you work best. For me, I tend to take an OCD approach to emptying things."}},"fields":{"path":"/2013/08/zero/","slug":"/2013/08/zero/"},"html":"<p><a href=\"http://zachholman.com/posts/inbox-zero-everything-zero\">Zach Holman</a>:</p>\n<blockquote>\n<p>Everyone works differently. The trick is finding out how you work best. For me, I tend to take an OCD approach to emptying things. I keep a clean desktop: under three icons at a time, preferably. It made sense to use my desktop as a kind of bucket I needed to empty: it's always there, and I can put short, actionable items there because that visually disturbs me enough to want to clean it off (and do the action).</p>\n<p>This is why Inbox Zero works so well for handling email for me. I try to use that mentality everywhere, really: iOS notifications, browser tabs, terminal tabs, and so on. Reducing ambiguity around what to do next is a huge deal for me.</p>\n</blockquote>\n<p>I have a similar mindset. I hate having stuffs in front of me:</p>\n<ul>\n<li>I close any app I don't use now</li>\n<li>I keep my tabs at a minimum</li>\n<li>I empty my mail inbox as much as I can</li>\n<li>I prune my RSS and Twitter feeds</li>\n<li>I clean my OS desktop</li>\n</ul>\n<p>A sort of minimalism? Probably.</p>"}},{"node":{"id":"ee887ff8-f061-5062-9ada-2a7e75f96a65","frontmatter":{"path":null,"title":"The Future Of Programming","date":"2013-08-06","readableDate":"06 August 2013","redirectFrom":null,"excerpt":"In the programming field, we have improved our tools, but globally, we are still doing the same thing: coding with text files. <em>That's sad</em>.","excerptQuote":null},"fields":{"path":"/2013/08/future-programming/","slug":"/2013/08/future-programming/"},"html":"<p>I finally watched the latest Brett Victor's conference: <a href=\"https://vimeo.com/71278954\">The Future Of Programming</a>. I highly recommend to check everything he has done. You will not loose your time.</p>\n<p>One of the moments I liked the best is when Brett Victor is talking about smalltalk and its browser view. This idea, that is fairly old now, reminds me of some initiatives like <a href=\"http://brackets.io/\">Brackets</a> or <a href=\"http://www.lighttable.com/\">Light Table</a>. These editors are still using text files to manage code, but they add inline code browsing or live feedback, amongst others. It is funny to see that we had to wait 40 years to see that happens.</p>\n<p>Which reminds me of the conclusion of Brett Victor: <strong>you have to realize that you do not know what you are doing in order to find new way of doing things</strong>.</p>\n<p>In the programming field, we have improved our tools, but globally, we are still doing the same thing: coding with text files. <em>That's sad</em>.</p>\n<h2>A brief aside</h2>\n<p>A theme that comes in almost all the Brett Victor's talks is live feedback. Just watch <a href=\"https://vimeo.com/36579366\">Inventing on Principle</a>.</p>\n<p>I have used Interface Builder a lot recently — a software to create interface for iOS apps —, and even if this tool is one of the best of its kind (I look at you Android, with your stupid XML UI files), it is not a good one for all that.</p>\n<p>It gives me a partial representation of my interface: I cannot do everything with it. I cannot see animations. I cannot see particles. I cannot test the physic (and physic is clearly one of the key points of the new iOS 7 interface). I loose a lot of time checking that what I have done in code and Interface Builder are really what I want. It is tedious. It is slow.</p>\n<p>We need better tools to create UI — we need <strong>feedback and interactivity</strong> directly within the creative process.</p>"}},{"node":{"id":"83f2e772-08f6-575a-b582-1eadeb9b8e97","frontmatter":{"path":null,"title":"Quote — Marco Arment","date":"2013-08-05","readableDate":"05 August 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Marco Arment","quote":"Tech companies with mobile apps can practically tile walls with outdated Android devices. They’re the new AOL CDs."}},"fields":{"path":"/2013/08/quote-marco-arment/","slug":"/2013/08/quote-marco-arment/"},"html":"<blockquote>\n<p>I offered to give my Nexus 7 and Kindle Fire to Betaworks in the Instapaper acquisition, but they had so many of both sitting around already that they declined. Tech companies with mobile apps can practically tile walls with outdated Android devices. They’re the new AOL CDs.</p>\n<p>— <a href=\"http://www.marco.org/2013/07/25/nexus-72\">Marco Arment</a></p>\n</blockquote>"}},{"node":{"id":"b4ec7e13-2dc2-5bfa-8312-ef082100fe4c","frontmatter":{"path":null,"title":"Windows Phone and WinRT","date":"2013-08-05","readableDate":"05 August 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Paul Thurrott","quote":"Microsoft already has a mobile platform with a thriving ecosystem. It’s called Windows Phone, and I think it makes a far better choice for general purpose tablets than does Windows RT."}},"fields":{"path":"/2013/08/os-wp-winrt/","slug":"/2013/08/os-wp-winrt/"},"html":"<p>From <a href=\"http://winsupersite.com/windows-phone/windows-phone-or-windows-rt\">Windows Phone or Windows RT?</a>:</p>\n<blockquote>\n<p>Microsoft already has a mobile platform with a thriving ecosystem. It’s called Windows Phone, and I think it makes a far better choice for general purpose tablets than does Windows RT.</p>\n</blockquote>\n<p>I used to have a Nokia Windows Phone, that I loved. The experience was pretty good, except for the lack of apps.<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup></p>\n<p>I created some Windows Phone 7 applications (notably <a href=\"http://dmayance.com/culturez-vous/\">Culturez-Vous</a> with Damien Mayance). I also developed a WinRT library for my daily work then — before Pixelnest.</p>\n<p>I had a Windows 8 and a WinRT device (Surface) at my workplace these days, and it was horrible. The experience was bad — the OS was a schizophrenic beast, always switching between the classic desktop and the Metro environment, with no apps. It was slow, unrefined, confusing. <a href=\"http://cl.ly/image/102N3O3C0k3z1c0g0u3g\">The font rendering was horrid</a>.</p>\n<p>When the announcement of WinRT became public, I wondered why Microsoft did not leverage its Windows Phone OS, instead of starting from scratch with Windows 8. A tablet with Windows Phone would have been far better than a tablet with the fail that is WinRT/Windows 8.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>To be fair, however, even then I thought that iOS was a superior OS. But I like to try a new OS to discover what works and not, and to make my own opinion.<br><br>Windows Phone lacked some polish but was rock solid, especially when compared to Android. At least, the Lumia was a supercharged feature phone with a browser and a decent keyboard.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>"}},{"node":{"id":"25c15b58-fb7e-57f7-8943-690409de44d4","frontmatter":{"path":null,"title":"Quote — \"Life is too short to stare at ugly graphs. And yes, you should feel bad.\"","date":"2013-08-02","readableDate":"02 August 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Tanoku","quote":"Likewise, we've spent a ton of valuable time graphing and mining data from all over our stack; it's only natural that after that, we care about how we present that data. Like typography, it's hard because it's an arduous hunt for the aesthetics hidden behind information."}},"fields":{"path":"/2013/08/life-too-short-ugly-graphs/","slug":"/2013/08/life-too-short-ugly-graphs/"},"html":"<blockquote>\n<p>It was done in-house. We really care about how our graphs look, because graphs represent information. It's like typography. Humans learned how to write 5000 years ago, and it took us a very long while until we mastered the art of transmitting information like that. Once we mastered it, however, we started caring about the way we present that information. For no specific reason, but we developed unique typefaces that look beautiful, different, yet transmit the same information.</p>\n<p>Likewise, we've spent a ton of valuable time graphing and mining data from all over our stack; it's only natural that after that, we care about how we present that data. Like typography, it's hard because it's an arduous hunt for the aesthetics hidden behind information. But this hunt is what makes us human.</p>\n<p>That's why we design beautiful graphs, just like we'd design a beautiful typeface. Not because we are GitHubbers, nor because we are designers, but because we are humans.</p>\n<p><strong>Life is too short to stare at ugly graphs. And yes, you should feel bad.</strong></p>\n<p>PS: we have no project managers at GitHub.</p>\n<p>— <a href=\"https://news.ycombinator.com/item?id=4480876\">Tanoku, Hacker News</a></p>\n</blockquote>\n<p>An oldie, but I'm still loving it (emphasis mine).</p>"}},{"node":{"id":"3cf94db8-10f9-5730-99bf-0bda42e3d798","frontmatter":{"path":null,"title":"Quote — \"Changing the world.\"","date":"2013-08-02","readableDate":"02 August 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Freyr","quote":"Could “changing the world” be a contender the most trite, overused expression of 2013?"}},"fields":{"path":"/2013/08/quote-changing-the-world/","slug":"/2013/08/quote-changing-the-world/"},"html":"<blockquote>\n<p>Could \"changing the world\" be a contender the most trite, overused expression of 2013? Recent grads seem to have adopted it en masse as their personal tagline. It's a nice sentiment, but it hard not to roll your eyes when every 23 year old applies it to his mobile phone app with no users that he threw together in a couple weeks.</p>\n<p>[…]</p>\n<p>Besides, I'm not even sure it's a healthy sentiment for most people. If your focus is as broad as \"changing the world,\" you're probably setting yourself up to feel like a failure.</p>\n<p>— <a href=\"https://news.ycombinator.com/item?id=6108967\">Freyr, Hacker News</a></p>\n</blockquote>\n<p>(via <a href=\"http://wolfslittlestore.be/2013/08/changing-the-world/\">Wolf's Little Store</a>)</p>"}},{"node":{"id":"d697b6d6-839e-5b2e-ad46-700bc0e6399c","frontmatter":{"path":null,"title":"Designer's decision","date":"2013-07-25","readableDate":"25 July 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Ben Howdle","quote":"Passing the buck to the user to make the UX decision for you? Sounds worse when it’s put like that, huh?"}},"fields":{"path":"/2013/07/designer-decision/","slug":"/2013/07/designer-decision/"},"html":"<p><a href=\"https://benhowdle.im/options-are-the-devil.html\">Ben Howdle, in “Options Are The Devil”</a>:</p>\n<blockquote>\n<p>It’s kind of like going, “Well, erm, I dunno, this is a tricky UI/UX decision, oh hell, we’ll let the user decide.” Passing the buck to the user to make the UX decision for you? Sounds worse when it’s put like that, huh?</p>\n</blockquote>"}},{"node":{"id":"2c0654b5-12c2-5b34-b021-3ce4735076e7","frontmatter":{"path":null,"title":"The rule of Three","date":"2013-07-24","readableDate":"24 July 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Jeff Atwood","quote":"If I have learned anything in my programming career, it is this: building reusable software, truly reusable software, is an incredibly hard problem – right up there with naming things and cache invalidation."}},"fields":{"path":"/2013/07/rule-three/","slug":"/2013/07/rule-three/"},"html":"<p><a href=\"http://www.codinghorror.com/blog/2013/07/rule-of-three.html\">Jeff Atwood</a>:</p>\n<blockquote>\n<p>If I have learned anything in my programming career, it is this: building reusable software, <em>truly</em> reusable software, is an incredibly hard problem – right up there with <a href=\"http://martinfowler.com/bliki/TwoHardThings.html\">naming things and cache invalidation</a>.</p>\n</blockquote>"}},{"node":{"id":"69ecde07-93fc-52da-b3a9-0e72f1d036e1","frontmatter":{"path":null,"title":"Current days science fiction","date":"2013-07-23","readableDate":"23 July 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"John Moltz","quote":"You couldn’t have written this as science fiction in 1997. No one would have believed it."}},"fields":{"path":"/2013/07/current-days-science-fiction/","slug":"/2013/07/current-days-science-fiction/"},"html":"<p><a href=\"http://verynicewebsite.net/2013/07/a-planet-where-apes-evolved-from-man/\">John Moltz</a>:</p>\n<blockquote>\n<p>Microsoft struggles to get developers on its platforms with apps coming late or not at all, developers ship for Apple first and foremost and the platform with the most market share is, ostensibly, open-source.</p>\n<p>You couldn’t have written this as science fiction in 1997. No one would have believed it.</p>\n</blockquote>"}}],"pathPrefix":"articles","first":false,"last":false,"index":8,"pageCount":9,"additionalContext":{}}}