{"data":{"site":{"siteMetadata":{"title":"Solar Sailer","author":"Matthieu Oger","description":"I am a developer, designer and product manager from France. Co-founder of Pixelnest Studio.","siteUrl":"https://matthieuoger.com/"}},"markdownRemark":{"html":"<p>For a few reasons, I'm considering whether or not I should be buying an Apple Watch.<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup></p>\n<p>For many people I know, it's another useless gadget.</p>\n<p>That's fine: most people are sceptical about new technologies, after all. It's in our nature: human doesn't like change (and new things) until it reaches a certain threshold and becomes acceptable. And to be fair, it might just be a fad.</p>\n<p>The iPhone (and other touch-based smartphones) were also considered as useless gadgets in their beginnings too — almost everybody has a smartphone now, right?<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup></p>\n<p>But like the iPhone, there's a chance the Apple Watch will succeed and become a thing (that's a big if, but I'm still more inclined to believe it will than not).</p>\n<p><strong>For the moment, I don't think there're many usages that make a watch (or other wearable devices) truly better than a phone</strong>. Hopefully, we are only at the beginning. To understand what we can do as developers, we have to use those objects daily.</p>\n<p>That's not to say they are completely useless as of today.</p>\n<p>The usages that intrigue me the most are:<sup id=\"fnref-3\"><a href=\"#fn-3\" class=\"footnote-ref\">3</a></sup></p>\n<ul>\n<li>Maps navigation (\"quick glance, straight on, a few haptic taps, go right — bam — you're arrived!\").</li>\n<li>Services like Capitaine Train <a href=\"https://blog.capitainetrain.com/8788-apple-watch\">(with an awesome watch app design that clearly understands its support and context)</a>.</li>\n<li>Passbooks and Apple Pay (if it ever comes to France).</li>\n<li>Music and podcasts playback (with Overcast or a remote).</li>\n<li>Fitness and health.</li>\n</ul>\n<p><strong>But not notifications.</strong></p>\n<hr>\n<p>I'm a huge proponent of disabling almost all notifications.</p>\n<p>I restrict the apps that can send notifications to the bare minimum (SMS, calendar, reminders and that's most of it) because I think that notifications are a nuisance.</p>\n<p>You don't need to know when someone followed you on Instagram or Twitter. You don't need to be interrupted when you receive a mail. That's also why I'm even more aggresive against sound for notifications (I do receive my mail every hour, but <em>silently</em>). I'd rather grab my phone and act willingly on something than being always distracted.</p>\n<p>People who are flooded by notifications (like <a href=\"http://www.theverge.com/a/apple-watch-review\">tech reviewers</a>) and criticize a device because of that ARE the issue, not the device. A wearable will only make their problem worse, because they will also allow access to those nuisance to a device that is physically connected to their body. And which can tap them <strong>anytime</strong>.</p>\n<hr>\n<p>What is really making sense is to have quick pertinent contextual information available at a glance.</p>\n<p>Like, when your train is ready to leave — which platform, what seat? That's useful: you are in a urge, you walk quickly and taking your phone out of your pocket takes time and precision.</p>\n<p>Having your itinerary directions given <a href=\"http://daringfireball.net/linked/2015/04/23/apple-watch-user-guide\">to you by a few vibrations</a>? That's great too.</p>\n<p>Having a full-fledged Twitter app on your wrist? Useless. Getting your Facebook likes instantly? Useless.<sup id=\"fnref-4\"><a href=\"#fn-4\" class=\"footnote-ref\">4</a></sup></p>\n<br>\n<p>I'm interested in wearables (<a href=\"https://www.google.com/glass/\">when they are not socially awkward</a>) because of what they might become. What they are today is just a glimpse of the potential of such devices.</p>\n<p>Imagine the application in the health field: with sensors on your body, it could be really easy to know and track diseases. To go there, we need to start small. For the moment, that means a watch with an heartbeat sensor and 18 hours of battery life.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>I probably won't, for the moment. <a href=\"http://steredenn.pixelnest.io\">Priorities</a>.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>And that's even the case in developing countries:</p>\n<blockquote>\n<p>Across all of this, and far more important, we are now well on our way to having some 3.5bn to 4bn people on earth with a smartphone. […] For the first time ever, the tech industry is selling not just to big corporations or middle-class families but to four fifths of all the adults on earth - <strong>it is selling to people who don’t have mains electricity or running water and substitute spending on cigarettes for mobile</strong>.</p>\n<p>— \"New questions in mobile\" by <a href=\"http://ben-evans.com/benedictevans/2014/11/20/time-for-new-questions-in-mobile\">Benedict Evans</a></p>\n</blockquote>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-3\">\n<p>The watch feature is probably the less important feature of a smartwatch. It's handy like it is on a phone. But like the phone feature of a smartphone, it's not the decisive capability.</p>\n<p>  Go on people, make jokes about a watch that is only able to tell the time for a day before running out of battery. ;)</p>\n<a href=\"#fnref-3\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-4\">\n<p>But that's also true for the web or an app, to be honest.</p>\n<a href=\"#fnref-4\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"date":"2015-04-25","readableDate":"25 April 2015","title":"Perspectives on wearables","showPageTitle":null,"excerptLine":"I'm interested in wearables (when they are not socially awkward) because of what they might become. What they are today is just a glimpse of the potential of such devices.","excerptQuote":null},"fields":{"path":"/2015/04/wearables/"}}},"pageContext":{"id":"2e001923-265d-5c75-9644-905f0be6f5ff"}}