{"pageContext":{"group":[{"node":{"id":"f0394ede-91d6-5a31-bf8c-3629b3d8ff55","frontmatter":{"path":null,"title":"Fast","date":"2019-08-01","readableDate":"01 August 2019","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Craig Mod","quote":"."}},"fields":{"path":"/2019/08/fast/","slug":"/2019/08/fast/"},"html":"<p>Craig Mod in <a href=\"https://craigmod.com/essays/fast_software/\">“Fast Software, the Best Software”</a>:</p>\n<blockquote>\n<p>I <em>love</em> fast software. That is, software speedy both in function and interface. Software with minimal to no lag between wanting to activate or manipulate something and the thing happening. Lightness.</p>\n<p>Software that’s speedy usually means it’s focused. Like a good tool, it often means that it’s simple, but that’s not necessarily true. Speed in software is probably the most valuable, least valued asset. To me, speedy software is the difference between an application smoothly integrating into your life, and one called upon with great reluctance.</p>\n<p>[…] Because — it’s not <em>quite</em> as fast. We’re talking milliseconds, but it’s enough that you <em>feel</em> the difference. […]</p>\n<p>[…] Still, the slowness feels indicative of unseen rot on the inside of the machine. The slowness is like an off smell. I don’t trust the application as much as I would if it didn’t slow down […]</p>\n<p>Speed and reliability are often intuited hand-in-hand. Speed can be a good proxy for general engineering quality. If an application slows down on simple tasks, then it can mean the engineers aren’t obsessive detail sticklers. Not always, but it can mean disastrous other issues lurk. I want all my craftspeople to stickle.</p>\n<p>[…] I love software that does this: Software that unbloats over time. This should be the goal of all software. The longer it’s around, the more elegant it should become. Smooth over like a river stone. […]</p>\n<p>[…] But why is slow bad? Fast software is not always good software, but slow software is rarely able to rise to greatness. Fast software gives the user a chance to “meld” with its toolset. That is, not break flow. […]</p>\n<p>[…] It feels — intuitively — that software (beyond core functionality) should aim for speed. Speed as a proxy for efficiency. […]</p>\n<p><em>Ultimately, to be fast is to be light.</em></p>\n</blockquote>\n<hr>\n<p>And then, similarly, <a href=\"https://craigmod.com/roden/028/\">in his latest Roden newsletter</a>:</p>\n<blockquote>\n<p>Part of me wishes there was more of a trend in the startup world to build sustainably small, single-serving, hyper-focused, <em>culturally-impactful</em> businesses.</p>\n</blockquote>"}},{"node":{"id":"46bddee8-d8bd-5581-b596-bc834d966164","frontmatter":{"path":null,"title":"It Doesn't Have to Be Crazy at Work","date":"2019-07-30","readableDate":"30 July 2019","redirectFrom":null,"excerpt":"Random highlights taken from the book “It Doesn't Have to Be Crazy at Work” by Basecamp.","excerptQuote":null},"fields":{"path":"/2019/07/book-basecamp/","slug":"/2019/07/book-basecamp/"},"html":"<p>Random highlights taken from the book “<a href=\"https://basecamp.com/books/calm\">It Doesn't Have to Be Crazy at Work</a>” by <a href=\"https://basecamp.com\">Basecamp</a>.</p>\n<hr>\n<p>Page 176:</p>\n<blockquote>\n<p>Later is where excuses live. Later is where good intentions go to die. Later is a broken back and a bent spirit. Later says “all-nighters are temporary until we’ve got this figured out.” Unlikely. Make the change now.</p>\n</blockquote>\n<p>Page 185:</p>\n<blockquote>\n<p>Being clear about what demands excellence and what’s perfectly okay just being adequate is a great way to bring a sense of calm into your work. You’ll worry less, you’ll accept more. “That’s fine” is such a wonderfully relaxing way to work most of the time. Save the occasional scrutiny for the differentiating details that truly matter.</p>\n</blockquote>\n<p>Page 182:</p>\n<blockquote>\n<p>We’ve been practicing disagree and commit since the beginning, but it took Bezos’s letter to name the practice. Now we even use that exact term in our discussions. “I disagree, but let’s commit” is something you’ll hear at Basecamp after heated debates about specific products or strategy decisions.</p>\n<p>Companies waste an enormous amount of time and energy trying to convince everyone to agree before moving forward on something. What they’ll often get is reluctant acceptance that masks secret resentment.</p>\n</blockquote>\n<p>Page 252:</p>\n<blockquote>\n<p>Jean-Louis Gassée, who used to run Apple France, describes this situation as the choice between two tokens. When you deal with people who have trouble, you can either choose to take the token that says “It’s no big deal” or the token that says “It’s the end of the world.” Whichever token you pick, they’ll take the other.</p>\n</blockquote>\n<p>Page 20:</p>\n<blockquote>\n<p>It begins with this idea: <em>your company is a product</em>.</p>\n<p>Yes, the things you make are products (or services), but your company is the thing that makes those things. That’s why your company should be your best product. […] That, like product development, progress is achieved through iteration. If you want to make a product better, you have to keep tweaking, revising, and iterating. The same thing is true with a company.</p>\n<p>[…]</p>\n<p>But when you think of the company as a product, you ask different questions: Do people who work here know how to use the company? Is it simple? Complex? Is it obvious how it works? What’s fast about it? What’s slow about it? Are there bugs? What’s broken that we can fix quickly and what’s going to take a long time?</p>\n<p>A company is like software. It has to be usable, it has to be useful. And it probably also has bugs, places where the company crashes because of bad organizational design or cultural oversights.</p>\n<p>When you start to think about your company as a product, all sorts of new possibilities for improvement emerge. When you realize the way you work is malleable, you can start molding something new, something better.</p>\n</blockquote>"}},{"node":{"id":"eeae8d6c-e9d7-5622-bdfc-7404adeca91b","frontmatter":{"path":null,"title":"Withhold the Fun","date":"2019-07-29","readableDate":"29 July 2019","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"John Siracusa","quote":"We established before the definition of enterprise software, the people who pay for the software and select it are not the people who use it — so your software being more desirable for users means almost nothing in the enterprise."}},"fields":{"path":"/2019/07/withhold-the-fun/","slug":"/2019/07/withhold-the-fun/"},"html":"<p><a href=\"https://atp.fm/episodes/335\">John Siracusa</a>, in episode 335 of <a href=\"https://atp.fm\">ATP</a>:</p>\n<blockquote>\n<p>\"We are trying to win on quality\". And if you try to win on quality in the enterprise, that is not a winning strategy, because, we established before the definition of enterprise software, <strong>the people who pay for the software and select it are not the people who use it so your software being more desirable for users means almost nothing in the enterprise.</strong></p>\n<p>All that matters is: does it do the thing that I needed to do, does it check all the checkboxes for compliance and <em>blablabla</em> and how much does it cost?</p>\n</blockquote>\n<p>(Emphasis mine)</p>"}},{"node":{"id":"8a29c6bc-e325-5e18-b79a-a66c150ec4b6","frontmatter":{"path":null,"title":"A Real Dial","date":"2019-04-13","readableDate":"13 April 2019","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Sebastiaan De With","quote":"When you come across an article set in a superb typeface for reading, some excellent airport signage or a well designed door handle, you don’t think about it or even notice it. If anything you might just notice being happier, or simply not frustrated. That’s how you know a design is great: it disappears."}},"fields":{"path":"/2019/04/a-real-dial/","slug":"/2019/04/a-real-dial/"},"html":"<p>From “<a href=\"https://blog.halide.cam/a-spectre-retrospective-part-2-design-708c2faf801b\">A Spectre Retrospective</a>”:</p>\n<blockquote>\n<p>Remember how I talked about the exposure duration dial, and how I really wanted it to feel like a tactile control like the one you have on a camera? The delightful clickiness of it, its precision, the appearance of etched metal… Delicious. How could we possibly translate this to a digital user interface? You’d just be tapping on glass.</p>\n<p>[…] The only issue was that my big silly thumb would totally obscure the control. […]</p>\n<p>But we didn’t have to also emulate the limitations of the physical world along with its wonderful tactile qualities: this is the digital world. We can make tiny phones fly. We can use a machine brain to pick the right settings for you.</p>\n<p>We can make the dial expand gracefully as you select an exposure time.</p>\n</blockquote>\n<p>Thus:</p>\n<blockquote>\n<p>This is probably my favorite part of the interface. Everything about it feels and looks perfect; Ben’s custom spring physics, my visual design iterations, and Jelmar’s completely custom typeface we use for the numerals. Three people worked hard on this little doodad — and most users probably wouldn’t even notice the work we put into it!</p>\n<p>I would argue that’s how you know that you’ve made something well.</p>\n<p><strong>When you come across an article set in a superb typeface for reading, some excellent airport signage or a well designed door handle, you don’t think about it or even notice it. If anything you might just notice being happier, or simply not frustrated. That’s how you know a design is great: it <em>disappears</em>.</strong></p>\n</blockquote>\n<p>(Emphasis mine)</p>"}},{"node":{"id":"77fd0ab1-955b-5193-9470-3495c299b49b","frontmatter":{"path":null,"title":"Better meetups and conferences","date":"2018-12-13","readableDate":"13 December 2018","redirectFrom":null,"excerpt":"Manage the noise, get multiple mics, have fresh air somewhere, help people talk to each other and reduce the number of attendees.","excerptQuote":null},"fields":{"path":"/2018/12/better-meetups-conferences/","slug":"/2018/12/better-meetups-conferences/"},"html":"<p>I was watching <a href=\"https://youtu.be/_9D6ZIEQalc\">this talk</a> by <a href=\"https://twitter.com/jessiechar\">Jessie Char</a> and it reminded me of some thoughts I have each time I attend a meetup or conference.</p>\n<p>I think we could improve these events with some little tweaks that would make the experience of every attendee better.</p>\n<ul>\n<li><strong>Manage the noise level</strong>. This is <em>the most important</em> thing. Noise must be low during the \"networking phase\", which means that the venue should not produce too much sound acoustically (and if it's not possible, simply reduce the number of people attending your event). People should be able to talk to each other at more than 20cm away after a talk. I can't count the number of times I approached a group, finding that I couldn't hear one single word because the room was too loud.</li>\n<li><strong>Get 3 mics</strong> at least. One for the moderator, one for the speaker (or group of speakers), and one for the audience. The audience also wants to listen to the questions. The speaker or moderator should repeat the question after hearing it anyways, but this common practice is often forgotten, unfortunately.</li>\n<li><strong>Fresh air access</strong>. This is more for conferences, since meetups are usually shorter. There's nothing worse than not being able to go outside for a few minutes every hour. Headaches and odors await otherwise.</li>\n<li><strong>Find ways to nudge people to talk to each other</strong>. There will be groups of people that know each other, so the task is, by default, harder for strangers. Give them help, find ways to make interaction more natural. It's not that hard, I think (but it depends on the venue and what your event is about). For conferences, what I like is when other activities are offered (games for examples) — it's good to have breaks. And many times you can meet new people more easily in a different setup.</li>\n<li><strong>Reduce</strong>. <strong>The</strong>. <strong>Number</strong>. <strong>Of</strong>. <strong>Attendees</strong>. I get it that organizers don't want a small number of people at their meetups or conferences. It's not as profitable and it's not as good for the press/reputation, but participants will thank you. 1) It helps people talking to each other after a talk. 2) It reduces noise. 3) It creates intimacy and makes people ask more questions to the speakers. 4) And, in fact, it reduces your cost and makes everything more manageable.</li>\n</ul>\n<p>There're many other things to do, but these are my main frustrations. For the rest, the talk linked above is excellent! :)</p>"}},{"node":{"id":"3be5f041-8eab-591b-a611-16e865c50944","frontmatter":{"path":null,"title":"Tools","date":"2018-12-05","readableDate":"05 December 2018","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Blood, Sweat and Pixels","quote":"That's what tool are. It's how fast can you iterate."}},"fields":{"path":"/2018/12/tools/","slug":"/2018/12/tools/"},"html":"<p>From “<a href=\"https://www.goodreads.com/book/show/34376766-blood-sweat-and-pixels\">Blood, Sweat and Pixels</a>” (written by <a href=\"https://twitter.com/jasonschreier\">Jason Schreier</a>):</p>\n<blockquote>\n<p>The biggest differentiator between a studio that creates a really high-quality <em>[product]</em> and a studio that doesn't isn't the quality of the team.</p>\n<p><strong>It's their dev tools.</strong></p>\n<p>If you can take fifty shots on goal, and you're a pretty shitty hockey player, and I can only take three shots on goal and I'm Wayne Gretzky, you're probably going to do better.</p>\n<p><strong>That's what tool are. It's how fast can you iterate</strong>, how stable are they, how robust are they, how easy it is as a nontechnical artist to move a thing.</p>\n</blockquote>\n<p>(Emphasis mine)</p>"}},{"node":{"id":"da2485ed-1c1c-5d0e-a43d-5e42f6553807","frontmatter":{"path":null,"title":"Flank it","date":"2018-11-26","readableDate":"26 November 2018","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Steve Yegge","quote":"Don’t try to beat a network by making a clone with improvements. It ain’t gonna work."}},"fields":{"path":"/2018/11/flank-it/","slug":"/2018/11/flank-it/"},"html":"<p><a href=\"https://medium.com/@steve.yegge/jeff-bezos-jack-ma-and-the-quest-to-kill-ebay-bb4992dc5020\">Steve Yegge</a>:</p>\n<blockquote>\n<p>[This] one is pretty goddamn important: Don’t try to beat a network by making a clone with improvements. It ain’t gonna work. There is too much gravitational inertia in the original network; nobody is incentivized to leave it.</p>\n<p>There are some approaches that will work […]. Both approaches require you to get into an entirely different market and build a network there. You can’t beat a strong network head-on, but you can flank it.</p>\n</blockquote>"}},{"node":{"id":"20a4687d-c669-5487-af9d-12cfb8e94227","frontmatter":{"path":null,"title":"The cost of bad design and the “ghetto of inattention”","date":"2018-11-14","readableDate":"14 November 2018","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Khoi Vinh","quote":"It’s the idea that design should make tech comfortable for people. It should put people at ease. So you have all these little cues that make people feel like they can explore the tech, they don’t have to worry about being caught in a trap or inadvertently triggering a nuclear meltdown. […] I mean, on the one hand, technology that consumers interact with has gotten so much better. […] But there’s this whole other sector of technology – the stuff that you and I don’t get to interact with everyday [like power plants or emergency centers]. That stuff still is pretty rough still."}},"fields":{"path":"/2018/11/bad-design/","slug":"/2018/11/bad-design/"},"html":"<p>From the “<a href=\"https://creative.gimletmedia.com/shows/wireframe/\">Wireframe</a>” podcast, “<a href=\"https://creative.gimletmedia.com/show/wireframe/episodes/good-design-human-centric/\">Good Design is Human</a>”:</p>\n<blockquote>\n<p>KHOI: […] It’s the idea that design should make tech comfortable for people. It should put people at ease. So you have all these little cues that make people feel like they can explore the tech, they don’t have to worry about being caught in a trap or inadvertently triggering a nuclear meltdown.</p>\n<p>AMY: But while human-centered design had permeated the world of consumer technology, not every industry has been as quick to adopt it.</p>\n<p>[…]</p>\n<p>AMY: In January 2018, an employee at The Hawaii Emergency Management Agency mistakenly issued a state-wide alert that went straight to residents’ cell phones. “Ballistic Missile Threat inbound to Hawaii,” it read. “Seek immediate Shelter. This is not a drill.”</p>\n<p>[…] This was supposed to be a safety drill. But the guy at the controls clicked on the wrong link. And you kind of can’t blame him… when you see the screen that he was looking at.</p>\n</blockquote>\n<hr>\n<blockquote>\n<p>KHOI: I mean, on the one hand, technology that consumers interact with has gotten so much better. We don’t have manuals anymore. Everything is much, much more intuitive. And so, design has really come a long way in that respect. But there’s this whole other sector of technology – the stuff that you and I don’t get to interact with everyday. The stuff that–  power plants or emergency centers. That stuff still is pretty rough still.</p>\n<p>CLIFF: The stuff that really needs to be redesigned is not apps and things like that. It’s the gnarly ugly enterprise software out there that sort of has escaped real scrutiny right? So, let’s say some piece of software for managing a trucking fleet.</p>\n<p>AMY: Too many of these kinds of tools still aren’t streamlined and friendly and easy-to-use the way our smart phones and laptops are. They have not yet, in other words, received the benefit of human-centered design.</p>\n<p>CLIFF: All these things actually, they exist almost in this kind of like “ghetto of inattention”. The greatest opportunities are within those things, this like gnarly machinery of everyday commerce that really powers the world we live in, but that has escaped notice.</p>\n</blockquote>"}},{"node":{"id":"bb67046e-b16a-5a7c-b2d5-be54a28ae79b","frontmatter":{"path":null,"title":"“Give it five minutes”","date":"2018-10-31","readableDate":"31 October 2018","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Richard Saul Wurman","quote":"It’s fine to disagree, it’s fine to push back, it’s great to have strong opinions and beliefs, but give my ideas some time to set in before you’re sure you want to argue against them."}},"fields":{"path":"/2018/10/give-it-five-minutes/","slug":"/2018/10/give-it-five-minutes/"},"html":"<blockquote>\n<p>[Richard Saul Wurman] said “Man, give it five minutes.” I asked him what he meant by that? He said, it’s fine to disagree, it’s fine to push back, it’s great to have strong opinions and beliefs, but give my ideas some time to set in before you’re sure you want to argue against them. “Five minutes” represented “think”, not react. He was totally right.</p>\n<p>[…]</p>\n<p>[He] has spent his career thinking about these problems. He’s given it 30 years. And I gave it just a few minutes. Now, certainly he can be wrong and I could be right, but it’s better to think deeply about something first before being so certain you’re right.</p>\n<p>— <a href=\"https://signalvnoise.com/posts/3124-give-it-five-minutes\">Jason Fried</a></p>\n</blockquote>\n<hr>\n<p>This comes to my mind every time I face new ideas, laws, structures, products, redesigns, or just a change in my life.</p>\n<p>When we talk about politics, for example, it's really easy to dismiss what someone is doing and say \"it's so stupid and I would do <em>this</em> instead of <em>that</em>, of course!\". Without understanding the big picture, or the <a href=\"https://www.youtube.com/watch?v=rStL7niR7gs\">keys</a> behind a problem, yeah, for sure we would do differently. This is not a justification for world destruction or horrible legislations, but a mental framework to acquire knowledge about why <em>it's</em> like that and how <em>it</em> could be really improved.</p>\n<p><strong>It's hard</strong>, and we all fell for it, but each time I try to understand the motivation or the <em>why</em> behind something I would push against, it always makes more sense, whether I liked it or not. Then, I get a better grasp on the problem. And sometimes, it can even change my mind.</p>"}}],"pathPrefix":"articles","first":true,"last":false,"index":1,"pageCount":10,"additionalContext":{}}}