{"pageContext":{"group":[{"node":{"id":"c0e850d3-c130-5cb0-92be-b85ee1eecb39","frontmatter":{"path":null,"title":"Paying for softwares","date":"2013-09-30","readableDate":"30 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Florian Kugler","quote":"[People] might say otherwise when asked about, but their actions speak pretty clearly: A cup of coffee is worth more than almost every app on the store. That's a hard pill to swallow, but we should let it sink in. We pour all our creativity, time, and passion into creating basically worthless products."}},"fields":{"path":"/2013/09/paying-for-softwares/","slug":"/2013/09/paying-for-softwares/"},"html":"<p>Florian Kugler about mobile apps in <a href=\"http://floriankugler.com/blog/2013/9/30/worth-less-than-a-cup-of-coffee\">Worth Less than a Cup of Coffee</a>:</p>\n<blockquote>\n<p>[People] might say otherwise when asked about, but their actions speak pretty clearly: A cup of coffee is worth more than almost every app on the store.</p>\n<p>That's a hard pill to swallow, but we should let it sink in. We pour all our creativity, time, and passion into creating basically worthless products.</p>\n</blockquote>\n<p>Recent events and the backlash <a href=\"http://realmacsoftware.com/blog/some-changes-for-clear\">against Realmac with Clear for iOS 7</a> are sad.</p>\n<p>People don't understand that creating softwares — <strong>truly</strong> good softwares that sweat every detail — takes a lot of time and money. Ironically, even a lot of developers who work in big companies don't want to pay for softwares.</p>\n<p>The mobile apps markets have made this situation worse.</p>\n<p>I'm currently thinking back about the mobile market, especially for games. At a time, I thought that going mobile-only was the best shot today, but the more I think about it, the more I'm realizing that a platform like Steam (which also drives the prices to the bottom, alas) is more sustainable for a developer/company.</p>\n<p><a href=\"http://www.marco.org/2013/09/28/underscore-price-dynamics\">Marco Arment</a> said in its latest blog post: <em>\"Paid-up-front iOS apps had a great run, but it’s over. Time to make other plans.\"</em>.</p>\n<p>So what does that leave? Freemium? Unfortunately, freemium almost always goes with <a href=\"https://itunes.apple.com/fr/app/candy-crush-saga/id553834731?mt=8\">bad apps or games that trick users to pay for more</a>.</p>\n<p>N.B.: To be clear, as a user, I'm happy to <em>pay less</em>. For almost everybody, a software or a game at 50-100$ is way too high, and that's fine. What I don't like is that we are now in a situation where  even one buck for an app you use daily is too much. <strong>One buck per app cannot sustain a one-person business.</strong></p>"}},{"node":{"id":"5c58a7ee-2064-56bf-a33e-0596b7f666a9","frontmatter":{"path":null,"title":"Patent trolls","date":"2013-09-17","readableDate":"17 September 2013","redirectFrom":null,"excerpt":"I'm not against patents and inventors' rights. But there is a big difference between protecting your properties from real thieves and suing everyone without actually creating anything. If the only solution to this problem is to abolish the patents system, so be it.","excerptQuote":null},"fields":{"path":"/2013/09/patent-trolls/","slug":"/2013/09/patent-trolls/"},"html":"<p><a href=\"http://arstechnica.com/tech-policy/2013/09/angry-entrepreneur-replies-to-patent-troll-with-racketeering-lawsuit/\">Angry entrepreneur replies to patent troll with racketeering lawsuit</a>:</p>\n<blockquote>\n<p>\"There's a lot of outrageous stories, but everyone's so damn afraid of coming forward—It's like going against the Mafia,\" he said. But the idea that trolls may retaliate against those who speak out is overblown, he thinks. \"If they want to try to teach me a lesson, go for it. This will be my retirement. I'll fight them.\"</p>\n</blockquote>\n<p>Here it is:</p>\n<ul>\n<li>Everyone knows that patent trolls are useless companies that only try to steal money from defenseless ones.</li>\n<li>Everyone knows that they don't invent anything.</li>\n<li>Everyone knows that they cost a lot — of time and money — with endless legal procedures.</li>\n<li>Everyone knows that it's pure bullshit and extortion, and yet, it is perfectly legal.</li>\n</ul>\n<p>Stupid system.</p>\n<hr>\n<p>I'm not against patents and inventors' rights. But there is a big difference between protecting your properties from real thieves and suing everyone without actually creating anything.</p>\n<p>However, if the only solution to this problem is to abolish the patents system, so be it.</p>"}},{"node":{"id":"327a58ea-f7c9-57bd-baf4-3bacc17781a1","frontmatter":{"path":null,"title":"Apple is future proof","date":"2013-09-16","readableDate":"16 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":null},"fields":{"path":"/2013/09/apple-is-future-proof/","slug":"/2013/09/apple-is-future-proof/"},"html":"<p><a href=\"http://cannyvision.com/2013/09/12/the-most-forward-thinking-apple-yet.html\">The Most Forward Thinking Apple Yet</a> (emphasis mine):</p>\n<blockquote>\n<p>In many ways, WWDC, and more so, the iPhone 5C and 5S represent (and had to represent) Apple's reply to the naysayers. <strong>However, I think there was more to the announcements than what met the eye.</strong></p>\n</blockquote>\n<p>Read the whole thing.</p>\n<p>Everything that Apple announced last week has no real purpose currently — or only a fraction of what will be possible with one day.</p>\n<p>For example, the fingerprint sensor is a really neat idea, but <a href=\"https://medium.com/mobile-world/b16ba37c433a\">we will be able to do a lot more with it in the future</a>. The use of the M7 motion co-processor or the 64-bits iOS are even less tangible. Unless you are Apple and you know what will be released next.</p>\n<p>They are calmly preparing the ground for the shape of things to come. <em>It's thrilling.</em></p>\n<p><br>N.B.: The Bluetooth LE technology that was embedded a few years ago was exactly that: at that time, it was useless, but in the context of a wearable Apple watch, it makes a <strong>lot</strong> of sense.</p>"}},{"node":{"id":"ab35334d-a224-5120-ae7b-15299c5e071f","frontmatter":{"path":null,"title":"Reeder 2","date":"2013-09-12","readableDate":"12 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":null},"fields":{"path":"/2013/09/reeder-2/","slug":"/2013/09/reeder-2/"},"html":"<p>Hell, it's about time.</p>\n<p>→ <a href=\"https://itunes.apple.com/nz/app/reeder-2/id697846300?ls=1&#x26;mt=8\">Get here</a>.</p>"}},{"node":{"id":"e69e524e-c046-5bfe-b32b-74ecc29ee1df","frontmatter":{"path":null,"title":"Brand and logo","date":"2013-09-11","readableDate":"11 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Oliver Reichenstein","quote":"This post is not about the technical quality of the logo. I am not writing about brand design, but about brand management. This is about a simple rule: Brand design follows brand management, not the other way around."}},"fields":{"path":"/2013/09/brand-and-logo/","slug":"/2013/09/brand-and-logo/"},"html":"<p><a href=\"http://ia.net/blog/logo-bullshit-co-inc/\">Fantastic essay by Oliver Reichenstein</a>:</p>\n<blockquote>\n<p>This post is not about the technical quality of the logo. I am not writing about brand design, but about brand management. This is about a simple rule: Brand design follows brand management, not the other way around.</p>\n<p>One could argue that we can’t say if this is bad brand management. Unless we know what the brand ambition, the brand architecture, and the brand strategy is, we ought to have no opinion. Maybe the logo does exactly what it is supposed to do. Because really, it doesn’t matter whether it looks pretty, or whether someone likes or dislikes the purple or the scallops. The Coca-Cola logo was not designed by a professional designer, it is typographically hideous, but that doesn’t matter. Brand identity is not about visual refinement or aesthetics. It can be purposely ugly, like the London Olympics logo. What is important is that it is done seriously.</p>\n</blockquote>\n<p>Personally, I don't care about Yahoo's new logo. Anything would be better off that the old one.</p>\n<p>By the way, I'm still amazed by the quality of the iA website, and especially the blog. Typography, details, everything. It's wonderful.</p>"}},{"node":{"id":"49d5cf03-afd9-5575-968e-b488ca47604f","frontmatter":{"path":null,"title":"Microsoft Out","date":"2013-09-09","readableDate":"09 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Charles Miller","quote":"An argument could be made that Microsoft was making the best PC software in its class. Not because it had suddenly found the ability to develop cool, innovative products, but because everyone else was dead."}},"fields":{"path":"/2013/09/microsoft-out/","slug":"/2013/09/microsoft-out/"},"html":"<p><a href=\"http://fishbowl.pastiche.org/2013/08/26/bundled_out/\">Great article by Charles Miller about Microsoft fall</a>:</p>\n<blockquote>\n<p>Microsoft did not make its mark as a builder of great things, but as a very successful bundler of good-enough things. […]</p>\n<p>Eventually by the mid-90s an argument could be made that Microsoft was making the best PC software in its class. Not because it had suddenly found the ability to develop cool, innovative products, but because everyone else was dead. […]</p>\n<p>Still, outside that monopoly, there is a clear distinction between Microsoft products that can trace their market dominance back to DOS, and those that can't. The former make money, the latter lose it.</p>\n</blockquote>\n<hr>\n<h2>Update <span class=\"more\">08 June 2018</span></h2>\n<p><a href=\"https://stratechery.com/2018/the-end-of-windows/\">It's</a> <a href=\"https://en.wikipedia.org/wiki/Satya_Nadella\">funny</a> <a href=\"https://blog.github.com/2018-06-04-github-microsoft/\">how</a> <a href=\"https://code.visualstudio.com/\">things</a> <a href=\"https://www.typescriptlang.org/\">change</a>…</p>"}},{"node":{"id":"8a38416c-0548-5ee3-8bc7-f8efb3f22209","frontmatter":{"path":null,"title":"Inventing the favicon","date":"2013-09-05","readableDate":"05 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":{"name":"Ray Sun","quote":"So there you go, the story of the invention of favicon.ico"}},"fields":{"path":"/2013/09/inventing-the-favicon/","slug":"/2013/09/inventing-the-favicon/"},"html":"<p><a href=\"http://ruthlessray.wordpress.com/2013/09/02/inventing-favicon-ico/\">Inventing Favicon.ico</a>:</p>\n<blockquote>\n<p>Bharat said, “this is good, right? Check it in?” And I said, “yeah, sure, how does it work?” […]</p>\n<p>So there you go, the story of the invention of favicon.ico.</p>\n</blockquote>\n<p>The story of a small and useful feature that was almost cancelled for no good reason.</p>"}},{"node":{"id":"27be0a30-7876-5a9b-811a-093a0bfa43f1","frontmatter":{"path":null,"title":"Samsung And Watches","date":"2013-09-05","readableDate":"05 September 2013","redirectFrom":null,"excerpt":null,"excerptQuote":null},"fields":{"path":"/2013/09/samsung-and-watches/","slug":"/2013/09/samsung-and-watches/"},"html":"<p><a href=\"http://stratechery.com/2013/shameless-samsung/\">Ben Thompson nails it in “Shameless Samsung“</a>:</p>\n<blockquote>\n<p>I jumped on the leaked prototype, with the same general sentiment: Samsung’s watch will undoubtedly change drastically whenever Apple’s wearable is released. And, to be certain, we will mock them for copying. […]</p>\n<p>We, especially in the West, have a powerful sense of justice and fairness when it comes to product features and being first. Business, though, is not fair, even if it is more just than we care to admit.</p>\n</blockquote>\n<p>The Samsung Galaxy Gear is horrid. I was tempted to write an article about watches and Samsung last week, but Ben Thompson did it way better today.</p>\n<ul>\n<li>Samsung rushes to create a ridiculous watch in order to be the first.</li>\n<li>Someone else (probably Apple) will release a great watch.</li>\n<li>Samsung will copy it.</li>\n</ul>\n<p>But hey, it's business, so it does not really matter if it's fair.</p>\n<p>N.B.: The only thing that is against Samsung in this case is that watches are fashion accessories.</p>\n<p>The only hardware maker that has a sense of fashion is Apple (the iPhone is almost a “jewel” in its form after all). A watch needs to be elegant and refined. Samsung is probably incapable of doing that given its history of tasteless products.</p>\n<p>N.B. 2: The fun fact with watches is that ordinary, they are quite expensive. $300-400 for a “smart” watch that looks like a quality watch won't be that much for the targeted market.</p>\n<p><strong>Update on N.B. 2</strong>:</p>\n<blockquote class=\"twitter-tweet\">\n<p>My watch is gold too. Thieves: grab that instead. You can buy a good few iPhones with the proceeds.</p>&mdash; Matt Gemmell (@mattgemmell) <a href=\"https://twitter.com/mattgemmell/statuses/385121349712490497\">October 1, 2013</a>\n</blockquote>"}},{"node":{"id":"149887b6-32a5-5e46-b794-c6c01b1f6738","frontmatter":{"path":null,"title":"Myosis","date":"2013-09-04","readableDate":"04 September 2013","redirectFrom":null,"excerpt":"A gorgeous short film.","excerptQuote":null},"fields":{"path":"/2013/09/myosis/","slug":"/2013/09/myosis/"},"html":"<p>A gorgeous short film.</p>\n<p>→ <a href=\"https://vimeo.com/73617382\">Watch here</a>.</p>"}}],"pathPrefix":"articles","first":false,"last":false,"index":6,"pageCount":10,"additionalContext":{}}}